{"type":"data","nodes":[{"type":"data","data":[null],"uses":{}},{"type":"data","data":[{"slug":1,"title":2,"date":3,"excerpt":4,"tags":5,"readingTime":7,"toc":8,"contentHtml":9,"prevPost":10,"nextPost":10},"2026-02-15 Autumn Sonata","Autumn Sonata (1978)","2026-02-15","A note on Bergman's Autumn Sonata.",[6],"film",5,[],"\u003Cp>\u003Cstrong>Contains spoilers\u003C/strong>\u003C/p>\n\u003Cp>Autumn Sonata is lifelong pain blown to the surface. It&#39;s never fully explained, never resolved, just ripped open between an absent mother and a daughter who learned to hate her own body.\u003C/p>\n\u003Cp>Bergman&#39;s rawness is here, as in all his work, but Autumn Sonata feels the most directly personal. He had nine children with six women. Charlotte is how he interrogates himself: what does obsessive focus on work cost the people who needed you? Some wounds never heal, and you may still try hopelessly to address them in old age with no promise of redemption. Like walking through a pitch-black tunnel, hoping for light. It may never come. You walk anyway.\u003C/p>\n\u003Cp>Viktor, a priest who calls himself the most uncertain person in his family, loves a woman who told him plainly she doesn&#39;t love him back. In the opening scene, he reads from Eva&#39;s book: if someone ever comes along who loves her, she might finally find the courage to look at herself in the mirror. Eva&#39;s dysmorphic self has been in development since Charlotte left them for the first time.\u003C/p>\n\u003Cp>Charlotte&#39;s absence cost her daughters dearly, yet somehow her presence is even worse. Eva, acting like a little girl once again, admires Charlotte and welcomes her with great enthusiasm. Later when Charlotte notices Eva has been playing Chopin, she makes her play for her. Viktor&#39;s comment clearly shows that Eva wanted to play for her mother anyway. She is nervous but plays. There is a brilliant long-take on Charlotte&#39;s face during this performance, showing all sorts of thoughts and emotions rushing through her head. This mother who had last seen her daughter seven years ago. Still, Charlotte seems to not be able to help it. She goes on to &quot;correct&quot; Eva. Telling her how to play the piece. To demonstrate the real challenge of playing Chopin, and noting that he is emotional, not sentimental, Charlotte proceeds to play the piece herself. There is a parallel shot here showing Eva this time listening to her mother play this piece, full of admiration, and yet a gaze that betrays her by showing her absolute hatred for Charlotte. The audacity she has to come back, yet again, to only correct her. Was Eva&#39;s hope of reconciliation fully naive? Maybe she is naive, just as Charlotte had called her before. The relationship cracks come to the surface. Charlotte can&#39;t even listen to or comfort Eva when she is telling her about how she feels about her son being drowned, yet she can talk about the emotional value of Chopin. Charlotte says about the prelude that &quot;The prelude must be made to sound almost ugly. It is never ingratiating. It should sound wrong. You have to battle your way through it and emerge triumphant&quot;. That mirrors their relationship perfectly, a wound that never resolves, doesn&#39;t heal, sounds ugly, and you must work through it and eventually emerge triumphant. Eva asks Charlotte if it&#39;s true that it&#39;s the daughter&#39;s misery that makes the mother joyous. A comment that is harsh and unfair, but understandable, as every mistake from Eva is a chance for Charlotte to correct her. One can&#39;t help but wonder if Charlotte just doesn&#39;t love correcting her and telling her how to live, judging incessantly. It was always this way.\u003C/p>\n\u003Cp>After being humiliated by a conductor who told Charlotte she was past her prime, she returns home. What she remembers as a wonderful summer, Eva remembers as torture. Charlotte forced braces on her for teeth she thought were crooked. Gymnastics for posture, she thought poor. A haircut Eva found hideous. Dresses Eva was never consulted on. Sophisticated books Eva was made to discuss, feeling stupid, too afraid to push back. Eva learned that nothing natural about her deserved love. Everything had to be corrected.\u003C/p>\n\u003Cp>Viktor says Eva became alive when her son was born. The boy drowned before his fourth birthday, but Eva insists he&#39;s still there if she focuses. She gave him the love she never received, and through his unquestioning love in return, she began to love herself. Viktor&#39;s love hasn&#39;t unlocked that yet. His goal is to make her see herself the way he sees her.\u003C/p>\n\u003Cp>Helena&#39;s illness is never named. She is the family&#39;s psychic damage made flesh, a body that cannot speak clearly, cannot reach out. When she receives real affection, she improves. Charlotte&#39;s friend/partner (??) Leonardo loved Helena, played Bach for her, kissed her. While he was present, she recovered. When he followed Charlotte out the door, Helena collapsed again. To her children, Charlotte not only doesn&#39;t give, but actively takes. Helena wakes up from her sleep during the main argument between Eva and Charlotte and comes downstairs, screaming for her mother and asking her to come. This isn&#39;t referenced by Eva and the others in the film again, and could be metaphorical for how she always needed her mother.\u003C/p>\n\u003Cp>The film ends with Eva writing to her mother despite everything. It&#39;s unclear if Eva is writing because she believes in reconciliation or just can&#39;t stop reaching out.\u003C/p>\n\u003Cp>Great artists make their work personal. Bergman is generous in how much of himself he reveals. But at 21, I can only meet this film partway. I know the shape of these wounds without having lived them. Cinema is the most immersive art form we have, and distance doesn&#39;t disqualify response, but it affects it.\u003C/p>\n\u003Cp>This is a conversation I&#39;ll return to.\u003C/p>\n",null],"uses":{"params":["slug"]}}]}
